<<<<<<< HEAD
export const classes = [{
    id: '01',
    name: '马院',
    major: [{
      id: '011',
      name: '思想政治教育'
    }, {
      id: '012',
      name: '马克思主义理论'
    }]
  },
  {
    id: '02',
    name: '哲学院',
    major: [{
        id: '021',
        name: '哲学'
      },
      {
        id: '022',
        name: '社会学'
      }
    ]
  },
  {
    id: '03',
    name: '国安院',
    major: [{
      id: '031',
      name: '公共管理类',
      major: [{
        id: '0311',
        name: '法学'
      }, {
        id: '0312',
        name: '行政管理'
      }, {
        id: '0313',
        name: '政治学与行政学'
      }]
    }]
  },
  {
    id: '04',
    name: '文学院',
    major: [{
      id: '041',
      name: '汉语言文学'
    }, {
      id: '042',
      name: '中国汉语言文学类',
      major: [{
        id: '0421',
        name: '秘书学'
      }]
    }]
  },
  {
    id: '05',
    name: '历史学院',
    major: [{
      id: '051',
      name: '历史学类',
      major: [{
        id: '0511',
        name: '文物与博物馆学'
      }, {
        id: '0512',
        name: '世界史'
      }]
    }, {
      id: '052',
      name: '历史学'
    }]
  },
  {
    id: '06',
    name: '教育学部',
    major: [{
        id: '061',
        name: '教育学类',
        major: [{
          id: '0611',
          name: '教育学'
        }]
      },
      {
        id: '063',
        name: '教育技术学'
      },
      {
        id: '064',
        name: '学前教育'
      }
    ]
  },
  {
    id: '07',
    name: '心理学院',
    major: [{
      id: '071',
      name: '心理学'
    }, {
      id: '072',
      name: '心理学类',
      major: [{
        id: '0721',
        name: '应用心理学'
      }]
    }]
  },
  {
    id: '08',
    name: '外语学院',
    major: [{
      id: '081',
      name: '外国语言文学类',
      major: [{
        id: '0811',
        name: '翻译'
      }]
    }, {
      id: '082',
      name: '英语'
    }, {
      id: '083',
      name: '法语'
    }, {
      id: '084',
      name: '俄语'
    }, {
      id: '085',
      name: '日语'
    }]
  },
  {
    id: '09',
    name: '数统院',
    major: [{
        id: '091',
        name: '数学类',
        major: [{
            id: '0911',
            name: '信息与计算科学'
          },
          {
            id: '0912',
            name: '统计学'
          }
        ]
      },
      {
        id: '092',
        name: '数学与应用数学'
      }
    ]
  },
  {
    id: '010',
    name: '物信院',
    major: [{
        id: '0101',
        name: '物理学类',
        major: [{
          id: '01011',
          name: '电子信息科学与技术'
        }]
      },
      {
        id: '0102',
        name: '物理学'
      }
    ]
  },
  {
    id: '011',
    name: '化学院',
    major: [{
        id: '0111',
        name: '化学类',
        major: [{
          id: '01111',
          name: '应用化学'
        }]
      },
      {
        id: '0112',
        name: '化学'
      }
    ]
  },
  {
    id: '012',
    name: '生科院',
    major: [{
        id: '0121',
        name: '生物科学类',
        major: [{
            id: '01211',
            name: '生物技术'
          },
          {
            id: '01212',
            name: '生态学'
          }
        ]
      },
      {
        id: '0122',
        name: '生物科学'
      }
    ]
  },
  {
    id: '013',
    name: '地科院',
    major: [{
      id: '0131',
      name: '地理科学类',
      major: [{
        id: '01311',
        name: '地理科学类'
      }]
    }, {
      id: '0132',
      name: '地理科学'
    }, {
      id: '0133',
      name: '环境科学'
    }, {
      id: '0134',
      name: '旅游管理'
    }]
  },
  {
    id: '014',
    name: '计科院',
    major: [{
      id: '0141',
      name: '计算机类',
      major: [{
        id: '01411',
        name: '软件工程'
      }, {
        id: '01412',
        name: '人工智能'
      }]
    }, {
      id: '0142',
      name: '计算机科学与技术'
    }]
  },
  {
    id: '015',
    name: '新传院',
    major: [{
        id: '0151',
        name: '新闻传播学类',
        major: [{
          id: '01511',
          name: '新闻学'
        }, {
          id: '01512',
          name: '编辑出版学'
        }, {
          id: '01513',
          name: '网络与新媒体'
        }]
      },
      {
        id: '0152',
        name: '播音与主持艺术'
      },
      {
        id: '0153',
        name: '广播电视编导'
      }
    ]
  },
  {
    id: '016',
    name: '体育学院',
    major: [{
      id: '0161',
      name: '体育教育'
    }, {
      id: '0162',
      name: '运动训练'
    }]
  },
  {
    id: '017',
    name: '美术学院',
    major: [{
        id: '0171',
        name: '美术学类',
        major: [{
            id: '01712',
            name: '视觉传达设计'
          },
          {
            id: '01713',
            name: '环境设计'
          },
          {
            id: '01714',
            name: '绘画'
          }
        ]
      },
      {
        id: '0172',
        name: '美术学'
      },
      {
        id: '0173',
        name: '书法学'
      }
    ]
  },
  {
    id: '018',
    name: '音乐学院',
    major: [{
      id: '0181',
      name: '音乐表演'
    }, {
      id: '0182',
      name: '音乐学'
    }, {
      id: '0183',
      name: '舞蹈学'
    }]
  },
  {
    id: '019',
    name: '国商学院',
    major: [{
        id: '0191',
        name: '经济学类',
        major: [{
            id: '01911',
            name: '经济学'
          },
          {
            id: '01912',
            name: '金融学'
          },
          {
            id: '01913',
            name: '数量金融'
          }
        ]
      },
      {
        id: '0192',
        name: '工商管理类',
        major: [{
            id: '01921',
            name: '财务管理'
          },
          {
            id: '01922',
            name: '人力资源管理'
          },
          {
            id: '01923',
            name: '大数据应用管理'
          },
          {
            id: '01924',
            name: '市场营销'
          }
        ]
      }
    ]
  },
  {
    id: '020',
    name: '食品学院',
    major: [{
      id: '0201',
      name: '食品科学与工程类',
      major: [{
        id: '02011',
        name: '食品科学与工程'
      }, {
        id: '02012',
        name: '食品营养与健康'
      }]
    }]
  }
=======

export const classes = [{
  id: '01',
  name: '马院',
  major: [{
    id: '011',
    name: '思想政治教育'
  }, {
    id: '012',
    name: '马克思主义理论'
  }]
},
{
  id: '02',
  name: '哲学院',
  major: [{
      id: '021',
      name: '哲学'
    },
    {
      id: '022',
      name: '社会学'
    }
  ]
},
{
  id: '03',
  name: '国安院',
  major: [{
    id: '031',
    name: '公共管理类',
    major: [{
      id: '0311',
      name: '法学'
    }, {
      id: '0312',
      name: '行政管理'
    }, {
      id: '0313',
      name: '政治学与行政学'
    }]
  }]
},
{
  id: '04',
  name: '文学院',
  major: [{
    id: '041',
    name: '汉语言文学'
  }, {
    id: '042',
    name: '中国汉语言文学类',
    major: [{
      id: '0421',
      name: '秘书学'
    }]
  }]
},
{
  id: '05',
  name: '历史学院',
  major: [{
    id: '051',
    name: '历史学类',
    major: [{
      id: '0511',
      name: '文物与博物馆学'
    }, {
      id: '0512',
      name: '世界史'
    }]
  }, {
    id: '052',
    name: '历史学'
  }]
},
{
  id: '06',
  name: '教育学部',
  major: [{
      id: '061',
      name: '教育学类',
      major: [{
        id: '0611',
        name: '教育学'
      }]
    },
    {
      id: '063',
      name: '教育技术学'
    },
    {
      id: '064',
      name: '学前教育'
    }
  ]
},
{
  id: '07',
  name: '心理学院',
  major: [{
    id: '071',
    name: '心理学'
  }, {
    id: '072',
    name: '心理学类',
    major: [{
      id: '0721',
      name: '应用心理学'
    }]
  }]
},
{
  id: '08',
  name: '外语学院',
  major: [{
    id: '081',
    name: '外国语言文学类',
    major: [{
      id: '0811',
      name: '翻译'
    }]
  }, {
    id: '082',
    name: '英语'
  }, {
    id: '083',
    name: '法语'
  }, {
    id: '084',
    name: '俄语'
  }, {
    id: '085',
    name: '日语'
  }]
},
{
  id: '09',
  name: '数统院',
  major: [{
      id: '091',
      name: '数学类',
      major: [{
          id: '0911',
          name: '信息与计算科学'
        },
        {
          id: '0912',
          name: '统计学'
        }
      ]
    },
    {
      id: '092',
      name: '数学与应用数学'
    }
  ]
},
{
  id: '010',
  name: '物信院',
  major: [{
      id: '0101',
      name: '物理学类',
      major: [{
        id: '01011',
        name: '电子信息科学与技术'
      }]
    },
    {
      id: '0102',
      name: '物理学'
    }
  ]
},
{
  id: '011',
  name: '化学院',
  major: [{
      id: '0111',
      name: '化学类',
      major: [{
        id: '01111',
        name: '应用化学'
      }]
    },
    {
      id: '0112',
      name: '化学'
    }
  ]
},
{
  id: '012',
  name: '生科院',
  major: [{
      id: '0121',
      name: '生物科学类',
      major: [{
          id: '01211',
          name: '生物技术'
        },
        {
          id: '01212',
          name: '生态学'
        }
      ]
    },
    {
      id: '0122',
      name: '生物科学'
    }
  ]
},
{
  id: '013',
  name: '地科院',
  major: [{
    id: '0131',
    name: '地理科学类',
    major: [{
      id: '01311',
      name: '地理科学类'
    }]
  }, {
    id: '0132',
    name: '地理科学'
  }, {
    id: '0133',
    name: '环境科学'
  }, {
    id: '0134',
    name: '旅游管理'
  }]
},
{
  id: '014',
  name: '计科院',
  major: [{
    id: '0141',
    name: '计算机类',
    major: [{
      id: '01411',
      name: '软件工程'
    }, {
      id: '01412',
      name: '人工智能'
    }]
  }, {
    id: '0142',
    name: '计算机科学与技术'
  }]
},
{
  id: '015',
  name: '新传院',
  major: [{
      id: '0151',
      name: '新闻传播学类',
      major: [{
        id: '01511',
        name: '新闻学'
      }, {
        id: '01512',
        name: '编辑出版学'
      }, {
        id: '01513',
        name: '网络与新媒体'
      }]
    },
    {
      id: '0152',
      name: '播音与主持艺术'
    },
    {
      id: '0153',
      name: '广播电视编导'
    }
  ]
},
{
  id: '016',
  name: '体育学院',
  major: [{
    id: '0161',
    name: '体育教育'
  }, {
    id: '0162',
    name: '运动训练'
  }]
},
{
  id: '017',
  name: '美术学院',
  major: [{
      id: '0171',
      name: '美术学类',
      major: [{
          id: '01712',
          name: '视觉传达设计'
        },
        {
          id: '01713',
          name: '环境设计'
        },
        {
          id: '01714',
          name: '绘画'
        }
      ]
    },
    {
      id: '0172',
      name: '美术学'
    },
    {
      id: '0173',
      name: '书法学'
    }
  ]
},
{
  id: '018',
  name: '音乐学院',
  major: [{
    id: '0181',
    name: '音乐表演'
  }, {
    id: '0182',
    name: '音乐学'
  }, {
    id: '0183',
    name: '舞蹈学'
  }]
},
{
  id: '019',
  name: '国商学院',
  major: [{
      id: '0191',
      name: '经济学类',
      major: [{
          id: '01911',
          name: '经济学'
        },
        {
          id: '01912',
          name: '金融学'
        },
        {
          id: '01913',
          name: '数量金融'
        }
      ]
    },
    {
      id: '0192',
      name: '工商管理类',
      major: [{
          id: '01921',
          name: '财务管理'
        },
        {
          id: '01922',
          name: '人力资源管理'
        },
        {
          id: '01923',
          name: '大数据应用管理'
        },
        {
          id: '01924',
          name: '市场营销'
        }
      ]
    }
  ]
},
{
  id: '020',
  name: '食品学院',
  major: [{
    id: '0201',
    name: '食品科学与工程类',
    major: [{
      id: '02011',
      name: '食品科学与工程'
    }, {
      id: '02012',
      name: '食品营养与健康'
    }]
  }]
}
>>>>>>> 3027babaa484006da260f25b9e5b45f297d4cd17
]